/*
 * @lc app=leetcode.cn id=461 lang=cpp
 *
 * [461] 汉明距离
 */

// @lc code=start
class Solution {
public:
    int hammingDistance(int x, int y) {
        int number_1 = x ^ y;  //通过异或运算符可把不同位换置成1
        int j = 0;  //计数器
        while(number_1)
        {
            number_1 &= number_1-1;
            j++;
        }
        return j;

    }
};
// @lc code=end

/********************************************************************************
 * @brief x和y异或可把不同位置变成1
 * 再统计1的个数就是解
 ********************************************************************************/
// 位运算
// 汉明距离就是两个相同长度的字符串中
// 不同字符的数量，本题求x，y二进制的汉明距离
// 使用异或运算符^，相同为1不同为0
// x ^ y可把不同位变换成1，相同位变换成0
// 求异就是本题解